       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOW17.
       AUTHOR. CHRISTIAN STRAMA.

       PROCEDURE DIVISION.

           DISPLAY 'expected message:'
           DISPLAY 'Called module HELLOW18'
           DISPLAY 'actual message:'
           CALL 'HELLOW18'.

           STOP RUN.

