//HELLOW1F   JOB  12345,'TEST JOB'
//
//STEP01    EXEC PGM=HELLOWO1
//SYSOUT    DD DSN=TEST.OUTPUT.FILES(HELLOW1F),
//              DISP=(NEW,DELETE,DELETE)   
//TESTDSN   DD DSN=TEST.OUTPUT.FILES2(TEMP),
//              DISP=(NEW,DELETE,DELETE)
//