       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOW93.
       AUTHOR. CHRISTIAN STRAMA.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01 TEST-VAR PIC X VALUE '1'.

       PROCEDURE DIVISION.
           GO TO 1000-FIRST-PARA.

       1000-FIRST-PARA.

           DISPLAY 'jumped to 1000-FIRST-PARA'.

           PERFORM 3000-THIRD-PARA.

       2000-SECOND-PARA.

           DISPLAY 'fallthrough to 2000-SECOND-PARA'.

       3000-THIRD-PARA.

           DISPLAY 'performed 3000-THIRD-PARA'.

