       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOW82.
       AUTHOR. CHRISTIAN STRAMA.

       ENVIRONMENT DIVISION. 

       INPUT-OUTPUT SECTION. 
       FILE-CONTROL.

           SELECT SORT-WORK-1    ASSIGN NODDNAME.

       DATA DIVISION.

       FILE SECTION. 

       SD  SORT-WORK-1
           RECORD 14.

       01  SORT-RECORD-1. 
           05 SORT-KEY   PIC X(4).
           05 SORT-DATA  PIC X(10).

       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.

           SORT SORT-WORK-1 ASCENDING SORT-KEY

              INPUT PROCEDURE IS 100-SORT-INPUT THRU 100-EXIT
              OUTPUT PROCEDURE IS 200-SORT-OUTPUT THRU 200-EXIT

           STOP RUN.

       100-SORT-INPUT.

           DISPLAY 'sort input'.

      *  LOAD THE SORT ARRAY WITH RECORDS. THIS IS PROBABLY A LOOP

      *  PROCESS THOSE RECORDS PRE-SORT (COUNTING, CHECKING, ETC.)

      *  'RELEASE' THE RECORD TO THE SORT ARRAY
      *    RELEASE SORT-RECORD-1

      *  WRAP IT UP WITH DISPLAY MESSAGES OR FILE/DB UPDATES

       100-EXIT.

           EXIT.

       200-SORT-OUTPUT.

           DISPLAY 'sort output'.

      * AFTER THE DATA IS SORTED DO SOMETHING WITH IT

       200-EXIT.

           EXIT.