//HELLOWOR   JOB  12345,'TEST JOB'
//
//STEP01    EXEC PGM=HELLOWO1
//SYSOUT    DD SYSOUT=*
//
//STEP02    EXEC PGM=HELLOWO2
//SYSOUT    DD SYSOUT=*
//STEP03    EXEC PGM=HELLOWO3
//SYSOUT    DD SYSOUT=*
//STEP04    EXEC PGM=HELLOWO4
//SYSOUT    DD SYSOUT=*