       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOW35.
       AUTHOR. CHRISTIAN STRAMA.

       PROCEDURE DIVISION.

           DISPLAY 'Called module HELLOW35'.

           STOP RUN.

