//HELLOW83   JOB  12345,'SORT TEST JOB'
//
//STEP01    EXEC PGM=HELLOW83
//WORKFILE  DD DSNAME=DATA.INPUT.FILES(SORTTEST)
//OUTPUTFILE DD DSNAME=TEST.OUTPUT.FILES.SORTED(HELLOW83),DISP(NEW,)
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//