       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOW92.
       AUTHOR. CHRISTIAN STRAMA.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01 TEST-ARRAY.
           05 TEST-ARRAY OCCURS 100 TIMES
        INDEXED TS-INDEX            PIC 9(3) COMP-3.

       PROCEDURE DIVISION.

           MOVE 3 TO TS-INDEX.

           STOP RUN.

