       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOW18.
       AUTHOR. CHRISTIAN STRAMA.

       PROCEDURE DIVISION.

           DISPLAY 'Called module HELLOW18'.

           STOP RUN.

