       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOW74.
       AUTHOR. CHRISTIAN STRAMA.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
           GO TO 1000-FIRST-PARA.

       1000-FIRST-PARA.

           DISPLAY 'jumped to 1000-FIRST-PARA'.

           GOBACK.

