       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOW17.
       AUTHOR. CHRISTIAN STRAMA.

       PROCEDURE DIVISION.

           CALL 'HELLOW18'.

           STOP RUN.

