       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOW99.
       AUTHOR. CHRISTIAN STRAMA.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01 N3    PIC 9(3).

       PROCEDURE DIVISION.
           
           INITIALIZE N3.

           DISPLAY 'N3=' N3.

           STOP RUN.

