       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWO1.
       AUTHOR. CHRISTIAN STRAMA.

       PROCEDURE DIVISION.

           DISPLAY 'hello world'.

           STOP RUN.

