       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOW40.
       AUTHOR. CHRISTIAN STRAMA.

       PROCEDURE DIVISION.

           DISPLAY 'hello world' UPON CONSOLE.

           STOP RUN.

