       IDENTIFICATION DIVISION.
       PROGRAM-ID. HEXTEST.
       AUTHOR. CHRISTIAN STRAMA.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01 TEST-VAR.
           05 CODE-ID  PIC X(4).
           05 PAD      PIC X(1).
           05 NUMBER-F PIC 9(5).
           05 JULIAN   PIC 9(7) COMP-3.
           05 FILLER   PIC X(71).

       PROCEDURE DIVISION.
       
           MOVE X'C8E4C8C5' TO CODE-ID.
           MOVE X'40' TO PAD.
           MOVE X'F0F0F0F8F0' TO NUMBER-F.
           MOVE X'2021365C' TO JULIAN.

           DISPLAY JULIAN.
           
           
      *    MOVE X'404040F04040404040404040404040404040404040404040404040
      *    4040404040404040404040404040404040404040404040404040404040404
      *    04040404040404040

           STOP RUN.