       IDENTIFICATION DIVISION. 
       PROGRAM-ID. GETDSNS.
       AUTHOR. CHRISTIAN STRAMA.

       DATA DIVISION. 

       WORKING-STORAGE SECTION. 

       LINKAGE SECTION. 

       COPY GETDSNS.

       PROCEDURE DIVISION USING GETDSNS-PARAMETERS.

           GET_DD_VALUE GP-DDNAME GP-DATA-SET-NAME GP-CURRENT-DATA-SETS.

           GOBACK.
