       IDENTIFICATION DIVISION.
       PROGRAM-ID. RANDSTR.
       
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       
       WORKING-STORAGE SECTION.
       01 STRING-COUNTER          PIC 9(02) VALUE 1.
       01 RANDOM-NUMBER           PIC 9(09).
       01 CHARACTERS-LIST         PIC X(62)
       .
       01 CHARACTER-TEMP          PIC X.

       LINKAGE SECTION. 

       COPY RANDSTR.
       
       PROCEDURE DIVISION USING STRING-LENGTH, RANDOM-STRING.
           MOVE SPACES TO RANDOM-STRING 

           MOVE 
        'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789'
           TO CHARACTERS-LIST.

           PERFORM STRING-GENERATION.
           
           GOBACK
           .
       
       STRING-GENERATION.
           PERFORM UNTIL STRING-COUNTER > STRING-LENGTH
              COMPUTE RANDOM-NUMBER = FUNCTION RANDOM(62)

              SET CHARACTER-TEMP TO CHARACTERS-LIST(RANDOM-NUMBER:1)
              MOVE CHARACTER-TEMP TO 
                 RANDOM-STRING(STRING-COUNTER:1)

              ADD 1 TO STRING-COUNTER 
           END-PERFORM
           .
